app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    #@users = User.all
    @search = User.search(params[:q])